{
    "apps": [
        {
            "##": "scoop依赖git更新仓库，git需放第一个",
            "Name": "git",
            "Source": "main",
            "Portable": true
        },
        {
            "Name": "md24",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "zentools",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "of",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "sp",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "zb",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "ps",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "ad",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "pwsh_with_context_menu",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "windowsterminal-shell",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "microsoft-wsl",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "7zip_context_menu",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "vscode_with_extensions",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "file_explorer_enhancer",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "anki_with_extensions",
            "Source": "Chuckie_s",
            "##": "TODO:想办法更新anki插件",
            "Portable": true
        },
        {
            "Name": "pureref",
            "Source": "Chuckie_s",
            "Portable": true
        },
        {
            "Name": "easy_u_vip",
            "Source": "Chuckie_s",
            "Portable": true
        },
        {
            "Name": "my_pycharm-professional",
            "Source": "Chuckie_s",
            "Portable": true
        },
        {
            "Name": "my_PSCompletions",
            "Source": "Chuckie_s",
            "Portable": true
        },
        {
            "Name": "wtq",
            "Source": "Chuckie_s",
            "Portable": true
        },
        {
            "Name": "ditto",
            "Source": "Chuckie_s",
            "Portable": true
        },
        {
            "Name": "msedge",
            "Source": "Chuckie_s",
            "Portable": true
        },
        {
            "Name": "tim",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "##": "TODO: fix 安装脚本",
            "Name": "WacomTablet-Install",
            "Source": "okibcn_ScoopMaster",
            "Portable": false
        },
        {
            "Name": "BaiduNetdisk",
            "Source": "abgox_abgo_bucket",
            "Portable": false
        },
        {
            "Name": "BaiduTranslate",
            "Source": "abgox_abgo_bucket",
            "Portable": false
        },
        {
            "##": [
                "pip 编译时要用到Microsoft Visual C++ 14 Build Tools（不是runtime）",
                "官方下载：在<https://my.visualstudio.com/Downloads> 中搜索Build Tools",
                "TODO:okibcn_ScoopMaster中的这个包没有正式安装的样子，参考以下2019版的安装脚本，提交pr使其正式安装",
                "https://github.com/okibcn/ScoopMaster/blob/master/bucket/vs_buildtools.json",
                "winget install --id=Microsoft.VisualStudio.2022.BuildTools  -e",
                "https://visualstudio.microsoft.com/zh-hans/visual-cpp-build-tools/"
            ],
            "Name": "msvc2022-buildtools-extra",
            "Source": "okibcn_ScoopMaster",
            "Portable": true
        },
        {
            "Name": "WubiLex",
            "Source": "okibcn_ScoopMaster",
            "Portable": true
        },
        {
            "##": [
                "# hosts中添加：",
                "# 127.0.0.1 hub5btmain.sandai.net",
                "# 127.0.0.1 hub5emu.sandai.net",
                "# 127.0.0.1 upgrade.xl9.xunlei.com"
            ],
            "Name": "ThunderSpeed",
            "Source": "okibcn_ScoopMaster",
            "Portable": false
        },
        {
            "##": "为scoop启用aria2加速",
            "Name": "aria2",
            "Source": "main",
            "Portable": true
        },
        {
            "Name": "calibre",
            "Source": "extras",
            "Portable": true
        },
        {
            "Name": "screentogif",
            "Source": "extras",
            "Portable": true
        },
        {
            "Name": "everything",
            "Source": "extras",
            "Portable": true
        },
        {
            "##": "support unpacking InnoSetup files",
            "Name": "innounp",
            "Source": "main",
            "Portable": true
        },
        {
            "Name": "keepassxc",
            "Source": "extras",
            "Portable": true
        },
        {
            "##": "TODO:将potplayer设为默认播放器，个性化设置",
            "Name": "potplayer",
            "Source": "extras",
            "Portable": true
        },
        {
            "Name": "powertoys",
            "Source": "extras",
            "Portable": true
        },
        {
            "Name": "python",
            "Source": "main",
            "Portable": true
        },
        {
            "Name": "screenoff",
            "Source": "extras",
            "Portable": true
        },
        {
            "Name": "starship",
            "Source": "main",
            "Portable": true
        },
        {
            "##": "TODO:自动安装suggest的包，开机启动等",
            "Name": "v2rayn",
            "Source": "extras",
            "Portable": true
        },
        {
            "##": [
                "https://learn.microsoft.com/en-us/cpp/windows/latest-supported-vc-redist",
                "the latest Microsoft Visual C++ Redistributable Packages 2015–2022 x64",
                "AKA Microsoft Visual C++ runtime",
                "starship 依赖"
            ],
            "Name": "vcredist-aio",
            "Source": "extras",
            "Portable": false
        },
        {
            "Name": "wechat",
            "Source": "extras",
            "Portable": false
        },
        {
            "##": [
                "powertoys,v2rayN 等依赖 DotNet Desktop Runtime 8",
                "注意，是dot net runtime不是dotnet sdk(versions/dotnet6-sdk)"
            ],
            "Name": "windowsdesktop-runtime-lts",
            "Source": "extras",
            "Portable": false
        },
        {
            "##": "'v2rayN' suggests installing 'v2ray'.",
            "Name": "v2ray",
            "Source": "main",
            "Portable": false
        },
        {
            "Name": "gsudo",
            "Source": "main",
            "Portable": true
        },
        {
            "Name": "chezmoi",
            "Source": "main",
            "Portable": true
        },
        {
            "##": "TODO:https://github.com/ajeetdsouza/zoxide 配置zoxide",
            "Name": "zoxide",
            "Source": "main",
            "Portable": true
        },
        {
            "##": "zoxide的zi命令需要",
            "Name": "fzf",
            "Source": "main",
            "Portable": true
        },
        {
            "Name": "archlinux",
            "Source": "Chuckie_s",
            "Portable": false
        },
        {
            "Name": "bbdown",
            "Source": "main",
            "Portable": true
        },
        {
            "Name": "docker",
            "Source": "main",
            "Portable": true
        },
        {
            "Name": "neovim",
            "Source": "main",
            "Portable": true
        },
        {
            "Name": "CascadiaCode-NF",
            "Source": "nerd-fonts",
            "Portable": false
        },
        {
            "Name": "im-select-imm",
            "Source": "PEMessage",
            "Portable": true
        }
    ],
    "buckets": [
        {
            "Name": "main",
            "Source": "https://github.com/ScoopInstaller/Main"
        },
        {
            "Name": "extras",
            "Source": "https://github.com/ScoopInstaller/Extras"
        },
        {
            "Name": "Chuckie_s",
            "Source": "https://github.com/ChuckieChen945/Chuckie_s"
        },
        {
            "Name": "okibcn_ScoopMaster",
            "Source": "https://github.com/okibcn/ScoopMaster"
        },
        {
            "Name": "anderlli0053_DEV-tools",
            "Source": "https://github.com/anderlli0053/DEV-tools"
        },
        {
            "Name": "abgox_abgo_bucket",
            "Source": "https://github.com/abgox/abgo_bucket"
        },
        {
            "Name": "abgox_abgox_bucket",
            "Source": "https://github.com/abgox/abgox-bucket"
        },
        {
            "Name": "nerd-fonts",
            "Source": "https://github.com/matthewjberger/scoop-nerd-fonts"
        },
        {
            "Name": "PEMessage",
            "Source": "https://github.com/PEMessage/im-select-imm"
        }
    ],
    "config": {
        "proxy": "127.0.0.1:10808",
        "root_path": "D:\\scoop\\",
        "abgo_bucket_no_shortcut": true,
        "abgo_bucket_no_confirm": true
    }
}
